damoreluc/Git_ESP32_Devkit_ADS1256_FFT_SIMUL_RTD_SSD1306_count_AsyncMQTT_binary_05/src/ADS1256.h
/*
 Name:		ADS1256.h
 Created:	11/21/2018 5:24:56 PM
 Author:	Yordan
*/

#ifndef _ADS1256_h
#define _ADS1256_h

#if defined(ARDUINO) && ARDUINO >= 100
	#include "arduino.h"
#else
	#include "WProgram.h"
#endif


#include "SPI.h"
#include "esp32-hal-gpio.h"

class ADS1256
{
	public:
		unsigned long adcValues[ 8 ];
		unsigned long adc_Raws[ 8 ] = { 0,0,0,0,0,0,0,0 };
		byte ads1256_mux[ 8 ] = { 0x08,0x18,0x28,0x38,0x48,0x58,0x68,0x78 };
		
		ADS1256();

		void init( SPIClass adsSpi, uint8_t _pinCS, uint8_t _pinRDY, uint8_t _pinRESET, uint32_t _speedSPI );
		void readInputToAdcValuesArray();

		//void readInputPEAKSToAdcValuesArray( int repeats );
        uint8_t readStatus();
		uint8_t readDataRate();
		uint32_t IRAM_ATTR ReadRawData();
		void standby();
		void wakeup();
		void sync();
		void reset();
		void setChannel(uint8_t channel);
		float IRAM_ATTR volt(uint32_t rawData);

	private:
        SPIClass _adsSpi;
    	uint8_t _pinCS;
		uint8_t _pinRDY;
		uint8_t _pinRESET;
		uint32_t _speedSPI;
	
	   uint8_t readRegister(uint8_t reg);
	   void    writeRegister(uint8_t reg, uint8_t value);
};


#endif
